## Pandas

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

All python imports that are needed shown.

Follow all the instructions in this notebook to complete these tasks.    

Make sure the CSV data files is in the same folder as this notebook - alumni.csv, groceries.csv

In [7]:
# Imports needed to complete this exam
import pandas as pd

### Question 1 :  Import CSV file (1 Mark)


Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [9]:
file_path = r'C:\Users\OT\Desktop\DELETE\alumni.csv'
alumni = pd.read_csv(file_path)

### Question 2 :  Understand the data set (5 Marks)

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [11]:
alumni.head

<bound method NDFrame.head of     Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
0             2004    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
2             2006  Female         Single      Standard Diploma       Yes
3             2007    Male        Married      Standard Diploma        No
4             2006  Female       Divorced      Standard Diploma       Yes
..             ...     ...            ...                   ...       ...
83            2007    Male         Single      Standard Diploma        No
84            2008       M         Single  College Prep Diploma       Yes
85            2009    Male        Married      Standard Diploma        No
86            2005  Female       Divorced      Standard Diploma       Yes
87            2006    Male        Married      Standard Diploma       Yes

    Salary    Fee Savings ($)
0   125000  10869    $86,000
1   100000  10869   $116,000
2    70000  10869    $52,000
3   120000  10869    $76,000
4    95000  11948    $52,000
..     ...    ...         ...
83   75000  12066    $16,000
84   65000  12066    $72,000
85   75000  12066    $46,000
86  100000  12067    $32,000
87   75000  12067    $67,000

[88 rows x 8 columns]>

In [13]:
alumni.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [15]:
alumni.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [17]:
alumni.info

<bound method DataFrame.info of     Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
0             2004    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
2             2006  Female         Single      Standard Diploma       Yes
3             2007    Male        Married      Standard Diploma        No
4             2006  Female       Divorced      Standard Diploma       Yes
..             ...     ...            ...                   ...       ...
83            2007    Male         Single      Standard Diploma        No
84            2008       M         Single  College Prep Diploma       Yes
85            2009    Male        Married      Standard Diploma        No
86            2005  Female       Divorced      Standard Diploma       Yes
87            2006    Male        Married      Standard Diploma       Yes

    Salary    Fee Savings ($)
0   125000  10869    $86,000
1   100000  10869   $116,000
2    70000  10869    $52,000
3   120000  10869    $76,000
4    95000  11948    $52,000
..     ...    ...         ...
83   75000  12066    $16,000
84   65000  12066    $72,000
85   75000  12066    $46,000
86  100000  12067    $32,000
87   75000  12067    $67,000

[88 rows x 8 columns]>

In [49]:
alumni.describe

<bound method NDFrame.describe of     Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
0             2004    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
2             2006  Female         Single      Standard Diploma       Yes
3             2007    Male        Married      Standard Diploma        No
4             2006  Female       Divorced      Standard Diploma       Yes
..             ...     ...            ...                   ...       ...
83            2007    Male         Single      Standard Diploma        No
84            2008       M         Single  College Prep Diploma       Yes
85            2009    Male        Married      Standard Diploma        No
86            2005  Female       Divorced      Standard Diploma       Yes
87            2006    Male        Married      Standard Diploma       Yes

    Salary    Fee Savings ($)
0   125000  10869    $86,000
1   100000  10869   $116,000
2    70000  10869    $52,000
3   120000  10869    $76,000
4    95000  11948    $52,000
..     ...    ...         ...
83   75000  12066    $16,000
84   65000  12066    $72,000
85   75000  12066    $46,000
86  100000  12067    $32,000
87   75000  12067    $67,000

[88 rows x 8 columns]>

### Question 3 :  Working with the data set (4)

a) get the median, b) mean and c) standard deviation for the 'Salary' column

In [47]:
median_value = alumni['Salary'].median()
median_value

75000.0

In [49]:
mean_value = alumni['Salary'].mean()
mean_value

84090.90909090909

In [51]:
standard_deviation = alumni['Salary'].std()
standard_deviation

21234.128008173615

# Select rows with over 70,000 on the salary

In [37]:
filt = alumni['Salary'] > 70000
filt

0      True
1      True
2     False
3      True
4      True
      ...
83     True
84    False
85     True
86     True
87     True
Name: Salary, Length: 88, dtype: bool

# Drop the Fee coulmn

In [39]:
filtered = alumni.loc[~filt,'Fee']
filtered

2     10869
5     11948
11    12717
17    10960
22    11691
30    10962
35    12058
40    11693
42    11693
47    10964
52    12062
54    12062
59    10968
62    11699
67    12065
69    11700
74    11700
77    11335
82    12066
84    12066
Name: Fee, dtype: int64

# Remove all rows where year geaduated is under 2006

In [41]:
remo = alumni['Year Graduated']>=2006
remo

0     False
1     False
2      True
3      True
4      True
      ...
83     True
84     True
85     True
86    False
87     True
Name: Year Graduated, Length: 88, dtype: bool